Repository: sithu-aung/flutter.dev
Catalog: lib/localization/app_*.arb
Languages: my

# flutter_about
source: Flutter is an open source framework by Google for building beautiful, natively compiled, multi-platform applications from a single codebase.
my: Flutter ဆိုတာ Codebase တခုထဲရေးပြီး မတူတဲ့ Platform မျိုးစုံမှာ အသုံးပြုနိုင်မဲ့ သေသပ်လှပတဲ့ အပလီကေးရှင်းများကို အလွယ်တကူ တည်ဆောက်ဖို့အတွက် Google က ထုတ်ထားပေးတဲ့ Open Source Framework ဖြစ်ပါတယ်

source: Fast
my: မြန်ဆန်

source: Productive
my: ထွက်တိုး

source: Flexible
my: ပြင်လွယ်

# fast_body
source: Flutter code compiles to ARM or Intel machine code as well as JavaScript, for fast performance on any device.
my: ဘယ် Device မှာမဆို မြန်ဆန်တဲ့လုပ်ဆောင်မှုကောင်းရဖို့ အတွက် Flutter ကုဒ်က ARM (သို့) Intel machine ကုဒ်အဖြစ် ပြောင်းလဲပေးပါတယ်

# productive_body
source: Build and iterate quickly with Hot Reload. Update code and see changes almost instantly, without losing state.
my: Hot Reload နဲ့ မြန်မြန်ဆန်ဆန် Build လုပ်လို့ရတယ်။ လုပ်လက်စ State မပျက်ဘဲ ကုဒ်ကို Update လုပ်ပြီး ချက်ချင်းကြည့်နိုင်တယ်

# flexible_body
source: Control every pixel to create customized, adaptive designs that look and feel great on any screen.
my: Pixel တခုချင်းစီကို ကိုယ့်စိတ်ကြိုက်ရေးနိုင်တဲ့အတွက် ဘယ် Screen မှာမဆို ကြည့်ကောင်းနေမဲ့ Adaptive UI တွေရေးနိုင်တယ်

source: Myanmar
my: မြန်မာ

source: English
my: အင်္ဂလိပ်

# try_in_dartpad
source: Try it in DartPad
my: DartPad သို့ သွားမည်
